Catalogs/ШаблоныТекстов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШаблоныТекстов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийШаблон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбластиПримененияШаблоновТекстов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовПочтовыхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПользовательИлиГруппа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КонтейнерПользователей</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСШаблонамиТекстовСервер/Ext/Module.bsl
// Возвращает список значений для выбора шаблона текста
Функция СформироватьДанныеВыбораШаблона(ПараметрыПолученияДанных, ОбластьПрименения) Экспорт 
	
	ПараметрыПолученияДанных.Отбор = Новый Структура;
	ПараметрыПолученияДанных.Отбор.Вставить("ОбластьПрименения", ОбластьПрименения);
	
	// временно. жду ответа от платформы.
	//Данные = Справочники.ШаблоныТекстов.ПолучитьДанныеВыбора(ПараметрыПолученияДанных);
	
	Текст = ПараметрыПолученияДанных.СтрокаПоиска; 
	Данные = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШаблоныТекстов.Ссылка КАК Ссылка,
	|	ШаблоныТекстов.Наименование КАК Наименование,
	|	ШаблоныТекстов.Шаблон КАК Шаблон
	|ИЗ
	|	Справочник.ШаблоныТекстов КАК ШаблоныТекстов
	|ГДЕ
	|	ШаблоныТекстов.Наименование ПОДОБНО &Текст
	|	И ШаблоныТекстов.ПометкаУдаления = ЛОЖЬ
	|	И ШаблоныТекстов.ОбластьПрименения = &ОбластьПрименения";
	
	Запрос.УстановитьПараметр("Текст", Текст + "%");
	Запрос.УстановитьПараметр("ОбластьПрименения", ОбластьПрименения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОписаниеШаблона = Новый Структура("Ссылка, Шаблон",
			Выборка.Ссылка, Выборка.Шаблон);
		Данные.Добавить(ОписаниеШаблона, Выборка.Наименование);
		
	КонецЦикла;	
	
	Возврат Данные;
	
КонецФункции
